Pipeflow_simpleFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.10280 0 0);

boundaryField
{
    axis
    {
        type            empty;
     
    }

    inlet
    {

          type           fixedValue;
          value          uniform  (0.10280 0 0);

   /*    type            flowRateInletVelocity;
        volumetricFlowRate     0.000583;
  */
    }

    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type zeroGradient;
    /*   type            inletOutlet;*/
    /*   inletValue  uniform     (0.10280 0 0);*/
    /*  value     uniform       (0.10280 0 0);*/
    }
    front
    {
        type            wedge;
   
    }
    back
    {
        type            wedge;
    }
   
}

// ************************************************************************* //
